app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    @cards = Card.all

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @card = Card.find(params[:id])

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def edit
    @card = Card.find(params[:id])

INSERT INTO "cards" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-05-09 08:55:10.301273"], ["updated_at", "2019-05-09 08:55:10.301273"]]
---
  def create
    @card = Card.new(user_params)
    if @card.save

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "cards" SET "book" = $1, "status" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["book", "Book"], ["status", "疲れたああああああああ"], ["updated_at", "2019-05-10 01:25:11.082602"], ["id", 23]]
---
  def update
    @card = Card.find(params[:id])
    if @card.update_attributes(user_params)

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 24]]
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def destroy
    if Card.find(params[:id]).destroy